<a href="https://colab.research.google.com/github/werowe/HypatiaAcademy/blob/master/class/Copy_of_homework_parent_child_explained.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
%load_ext sql

In [ ]:
 #!pip install "prettytable==3.11.0"

Collecting prettytable==3.11.0
  Downloading prettytable-3.11.0-py3-none-any.whl.metadata (30 kB)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.12/dist-packages (from prettytable==3.11.0) (0.2.14)
Downloading prettytable-3.11.0-py3-none-any.whl (28 kB)
Installing collected packages: prettytable
  Attempting uninstall: prettytable
    Found existing installation: prettytable 3.17.0
    Uninstalling prettytable-3.17.0:
      Successfully uninstalled prettytable-3.17.0
Successfully installed prettytable-3.11.0

In [ ]:
%sql sqlite:///random.db

In [ ]:
%%sql
DROP TABLE IF EXISTS parent;
DROP TABLE IF EXISTS child;

 * sqlite:///random.db
Done.
Done.

[]

In [ ]:
import random

# we want to make random data

def getName():

    fnames = ["Marya", "Diana", "Oleskii", "Yulia", "Illias", "Vlad", "Egor"]

    lnames = ["Zelensky", "Kovalenko", "Kravchenko", "Hrytsenko", "Melnyk"]

    return fnames[random.randint(0, len(fnames)-1)] +  " " + lnames[random.randint(0, len(lnames)-1)]

In [ ]:
# you need some common element to link two tables

%%sql

CREATE TABLE parent
  (
    parent_id INTEGER PRIMARY KEY AUTOINCREMENT,
    parent_name text,
    date_created text
  );

CREATE TABLE child
  (
    child_id INTEGER PRIMARY KEY AUTOINCREMENT,
    parent_id INTEGER,
    child_name text,
    date_created text
  );

 * sqlite:///random.db
Done.
Done.

[]

In [ ]:
%%sql
insert into parent(parent_name, date_created) values("fred", "2024-10-08");
insert into parent(parent_name, date_created) values("jane", "2024-10-08");

 * sqlite:///random.db
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
select * from parent

 * sqlite:///random.db
Done.

[(1, 'fred', '2024-10-08'), (2, 'jane', '2024-10-08')]

In [ ]:
%%sql
select * from parent

 * sqlite:///random.db
Done.

[(1, 'fred', '2024-10-08'), (2, 'jane', '2024-10-08')]

In [ ]:
%%sql
insert into child(parent_id, child_name, date_created) values(1, "oleskii", "2024-10-08");
insert into child(parent_id, child_name, date_created) values(1, "Egor", "2024-10-08");

 * sqlite:///random.db
1 rows affected.
1 rows affected.

[]

In [ ]:

%%sql
insert into child(parent_id, child_name, date_created) values(2, "George", "2024-10-08");
insert into child(parent_id, child_name, date_created) values(2, "Yeremii", "2024-10-08");

 * sqlite:///random.db
1 rows affected.
1 rows affected.

[]

# Join


this means put two tables together


* customers  for each
* orders     you have many orders

In [ ]:
%%sql

select * from child

 * sqlite:///random.db
Done.

[(1, 1, 'oleskii', '2024-10-08'), (2, 1, 'Egor', '2024-10-08')]

In [ ]:
%%sql

SELECT parent.parent_name, child.child_name
FROM parent, child
WHERE parent.parent_id = child.parent_id

 * sqlite:///random.db
Done.

[('fred', 'oleskii'),
 ('fred', 'Egor'),
 ('jane', 'George'),
 ('jane', 'Yeremii')]

In [ ]:
%%sql

SELECT parent.parent_name, child.child_name
FROM parent, child
WHERE parent.parent_id = child.parent_id
      and parent.parent_name = "jane"

 * sqlite:///random.db
Done.

[('jane', 'George'), ('jane', 'Yeremii')]

In [ ]:
%%sql


CREATE TABLE orders
  (
    order_id INTEGER PRIMARY KEY AUTOINCREMENT,
    product_id INTEGER,
    product_name text,
    sales_amount real
  );

 * sqlite:///random.db
Done.

[]

In [ ]:
%%sql
INSERT INTO orders(product_id, product_name, sales_amount) values("456", "Snickers", 15);
INSERT INTO orders(product_id, product_name, sales_amount) values("456", "Snickers", 25);

 * sqlite:///random.db
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql

select sum(sales_amount), product_name from orders
group by product_id

 * sqlite:///random.db
Done.

[(400.0, 'M & M'), (40.0, 'Snickers')]

In [ ]:
%%sql

select count(sales_amount), product_name from orders
group by product_id

 * sqlite:///random.db
Done.

[(2, 'M & M'), (2, 'Snickers')]

In [ ]:
%%sql

select ave(sales_amount), product_name from orders
group by product_id

 * sqlite:///random.db
(sqlite3.OperationalError) no such function: ave
[SQL: select ave(sales_amount), product_name from orders
group by product_id]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

#Homework


1. Create some data using parent-child relation.

2.Do some join operations.

3. Do some some, count.

4. Use date_cretea and figure out how to get automatically the current date.

# join statement

select something_from_first table as shorthand1,
       something_from_second table as shorthand2

from firs_table, second_table

where shorthand1 = shorthand1


# shorthand1 is somethinf in table
# sharthand2 is somethibg in table 2

In [ ]:
# use the join operation to get data from both tables, joining on the common column parent_id


%%sql

SELECT parent.parent_name, child.child_name
FROM parent, child
WHERE parent.parent_id = child.parent_id

 * sqlite:///random.db
Done.

[('fred', 'oleskii'), ('fred', 'Egor')]

In [ ]:
%%sql

select * from child

 * sqlite:///random.db
Done.

[(1, 1, 'oleskii', '2024-10-08'),
 (2, 1, 'Egor', '2024-10-08'),
 (3, 1, 'Vlad Zelensky', '2024-10-08')]